УправлениеИТФирмой_First/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЮридическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПочтовыйАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Программы</name>
    <attributes>
      <name>Программа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УправлениеИТФирмой_First/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

УправлениеИТФирмой_First/src/Catalogs/Контрагенты/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	
КонецПроцедуры  
 
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) 
	 
	Если ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
		
		Если СтрДлина (ИНН) <> 10 Тогда
			Сообщить("ИНН Юридического лица должен состоять из 10 цифр");
			Отказ = Истина;
		КонецЕсли;
		
		ПравильныйИНН = РаботаСИНН.ИННВерен(ИНН);
		
		Если Не ПравильныйИНН Тогда
			Отказ = Истина;
			Сообщить("ИНН не верен");
		КонецЕсли;
		
		Если СтрДлина (КПП) <> 9 Тогда
			Сообщить("КПП состоит из 9 цифр");
			Отказ = Истина;
		КонецЕсли;
		
	ИначеЕсли ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда 
		
		Если СтрДлина (ИНН) <> 12 Тогда
			Сообщить("ИНН Физического лица должен состоять из 12 цифр");
			Отказ = Истина;
		КонецЕсли;
		
		Если СтрДлина (КПП) > 0 Тогда
			Сообщить("КПП Физического лица должно быть пустое");
			Отказ = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	
	ДлинаСтроки = СтрДлина(ИНН);
	Для Счетчик = 1 По ДлинаСтроки Цикл
		СимволСтроки = Сред(ИНН, Счетчик, 1);
		КодСиволаСтроки = КодСимвола(СимволСтроки);
		Если КодСиволаСтроки < 48 Или КодСиволаСтроки >57 Тогда 
			Сообщить("ИНН может состоять только из цифр.");
			Отказ = Истина;
		КонецЕсли;	
		
	КонецЦикла;   
	
	ДлинаСтроки = СтрДлина(КПП);
	Для Счетчик = 1 По ДлинаСтроки Цикл
		СимволСтроки = Сред(КПП, Счетчик, 1);
		КодСиволаСтроки = КодСимвола(СимволСтроки);
		Если (КодСиволаСтроки < 48 Или КодСиволаСтроки >57) и ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда 
			Сообщить("КПП может состоять только из цифр.");
			Отказ = Истина;
		КонецЕсли;							
		
	КонецЦикла;
					
КонецПроцедуры
